sys/238.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">       
      <input>
            &lt;SYSMessage&gt;
            &lt;messageGuid value="<%=messageGuid %>" /&gt;
                    &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="238" value="Lohusa Izlem Veri Seti"/&gt;
                    &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
                        &lt;author&gt;
                        &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
                            &lt;/author&gt;
                            &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
                        &lt;recordData&gt;
                        &lt;LOHUSA_IZLEM&gt;
                                &lt;IZLEMIN_YAPILDIGI_YER version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=IZLEMIN_YAPILDIGI_YER.KODU %>" value="<%=IZLEMIN_YAPILDIGI_YER.ADI %>" /&gt;
                                &lt;KACINCI_LOHUSA_IZLEM version="1" codeSystemGuid="05d2b394-9c2b-4b2a-8a3a-8b5023187502" code="<%=KACINCI_LOHUSA_IZLEM.KODU %>" value="<%=KACINCI_LOHUSA_IZLEM.ADI %>" /&gt;
                                &lt;DEMIR_LOJISTIGI_VE_DESTEGI version="1" codeSystemGuid="83c966d5-1054-451c-87c6-19a0e11b287b" code="<%=DEMIR_LOJISTIGI_VE_DESTEGI.KODU %>" value="<%=DEMIR_LOJISTIGI_VE_DESTEGI.ADI %>" /&gt;
                                &lt;D_VITAMINI_LOJISTIGI_VE_DESTEGI version="1" codeSystemGuid="672986f8-5e0d-43a6-b417-37bdc59cd09b" code="<%=D_VITAMINI_LOJISTIGI_VE_DESTEGI.KODU %>" value="<%=D_VITAMINI_LOJISTIGI_VE_DESTEGI.ADI %>" /&gt;
                                &lt;GEBELIK_SONLANMA_TARIHI value="<%=GEBELIK_SONLANMA_TARIHI %>" /&gt;
                                &lt;POSTPARTUM_DEPRESYON version="1" codeSystemGuid="8e9f8b79-e70a-427f-ad8c-add091dd4a7c" code="<%=POSTPARTUM_DEPRESYON.KODU %>" value="<%=POSTPARTUM_DEPRESYON.ADI %>" /&gt;
                                &lt;UTERUS_INVOLUSYON version="1" codeSystemGuid="d7df9348-aefb-1248-e040-7c0a02161f00" code="<%=UTERUS_INVOLUSYON.KODU %>" value="<%=UTERUS_INVOLUSYON.ADI %>" /&gt;
                                <%if(PAKETE_AIT_ISLEM_ZAMANI!=-1){ %>
                                    &lt;PAKETE_AIT_ISLEM_ZAMANI value="<%=PAKETE_AIT_ISLEM_ZAMANI %>" /&gt;
                                    <% }%>
                                <%if(ISLEM_YAPAN!=-1){ %>
                                    &lt;ISLEM_YAPAN value="<%=ISLEM_YAPAN %>" /&gt;
                                <% }%>
                                <%if(BILGI_ALINAN_KISI_ADI_SOYADI!=-1){ %>
                                    &lt;BILGI_ALINAN_KISI_ADI_SOYADI value="<%=BILGI_ALINAN_KISI_ADI_SOYADI %>" /&gt;
                                <% }%>
                                <%if(BILGI_ALINAN_KISI_TEL!=-1){ %>
                                    &lt;BILGI_ALINAN_KISI_TEL value="<%=BILGI_ALINAN_KISI_TEL %>" /&gt;
                                <% }%>
                                <%if(KADIN_SAGLIGI_ISLEMLERI!=-1){ %>
                                        &lt;KADIN_SAGLIGI_ISLEMLERI_BILGISI&gt;
                                        <% for(var i=0; i < KADIN_SAGLIGI_ISLEMLERI.length; i++) {%>
                                            &lt;KADIN_SAGLIGI_ISLEMLERI version="1" codeSystemGuid="9f10cc39-f47a-4611-b328-78e044a8a2bc" code="<%=KADIN_SAGLIGI_ISLEMLERI[i].KODU %>" value="<%=KADIN_SAGLIGI_ISLEMLERI[i].ADI %>" /&gt;
                                        <% }%>
                                        &lt;/KADIN_SAGLIGI_ISLEMLERI_BILGISI&gt;
                                <% }%>
                                <%if(KONJENITAL_ANOMALI_VARLIGI!=-1){ %>
                                    &lt;KONJENITAL_ANOMALI_VARLIGI version="1" codeSystemGuid="484b2fc2-d1a2-4675-872e-c2c56e72d921" code="<%=KONJENITAL_ANOMALI_VARLIGI.KODU %>" value="<%=KONJENITAL_ANOMALI_VARLIGI.ADI %>" /&gt;
                                <% }%>
                                <%if(PAKETE_AIT_ISLEM_ZAMANI!=-1){ %>
                                    &lt;HEMOGLOBIN value="<%=HEMOGLOBIN %>" /&gt;
                                <% }%>
                                <%if(KOMPLIKASYON_TANISI!=-1){ %>
                                    &lt;KOMPLIKASYON_TANISI_BILGISI&gt;
                                    <% for(var i=0; i < KOMPLIKASYON_TANISI.length; i++) {%>
                                        &lt;KOMPLIKASYON_TANISI version="1" codeSystemGuid="c3eaabad-8c4c-56ee-e043-14031b0a5530" code="<%=KOMPLIKASYON_TANISI[i].KODU %>" value="<%=KOMPLIKASYON_TANISI[i].ADI %>" /&gt;
                                    <% }%>
                                    &lt;/KOMPLIKASYON_TANISI_BILGISI&gt;
                                 <% }%>
                                 <%if(GEBELIK_LOHUSALIK_SEYRINDE_TEHLIKE_ISARETI!=-1){ %>
                                    &lt;GEBELIK_LOHUSALIK_SEYRINDE_TEHLIKE_ISARETI_BILGISI&gt;
                                    <% for(var i=0; i < GEBELIK_LOHUSALIK_SEYRINDE_TEHLIKE_ISARETI.length; i++) {%>
                                        &lt;GEBELIK_LOHUSALIK_SEYRINDE_TEHLIKE_ISARETI version="1" codeSystemGuid="86d2237f-1896-41cc-bfd5-7745cd576e2d" code="<%=GEBELIK_LOHUSALIK_SEYRINDE_TEHLIKE_ISARETI[i].KODU %>" value="<%=GEBELIK_LOHUSALIK_SEYRINDE_TEHLIKE_ISARETI[i].ADI %>" /&gt;
                                    <% }%>
                                    &lt;/GEBELIK_LOHUSALIK_SEYRINDE_TEHLIKE_ISARETI_BILGISI&gt;
                                 <% }%>
                              
                               



                                 
                        &lt;/LOHUSA_IZLEM&gt;

                        &lt;HASTA_TAKIP_BILGISI&gt;
                            &lt;SYSTakipNo value="<%=SYSTakipNo %>" /&gt;
                                &lt;/HASTA_TAKIP_BILGISI&gt;
                                &lt;/recordData&gt;
                                &lt;/SYSMessage&gt;
                </input>
            </SYSSendMessage>
            </s:Body>
    </s:Envelope>